//****************************************************************
//
// ランキングの処理[ranking.cpp]
// Author Kensaku Hatori
//
//****************************************************************
#include "ranking.h"

using namespace std;

//****************************************************************
// コンストラクタ
//****************************************************************
CRanking::CRanking()
{
	m_nMin = NULL;
	m_nSec = NULL;
	Init();
}

//****************************************************************
// デストラクタ
//****************************************************************
CRanking::~CRanking()
{

}

//****************************************************************
// 初期化
//****************************************************************
HRESULT CRanking::Init(void)
{
	ifstream pFileMin("data\\Ranking.txt");
	string Minline = {};

	getline(pFileMin, Minline);

	istringstream issMin(Minline);

	issMin >> m_nMin;

	pFileMin.close();

	ifstream pFileSec("data\\Ranking.txt");
	string Secline = {};

	getline(pFileSec, Secline);

	istringstream issSec(Secline);

	issSec >> m_nSec;

	pFileSec.close();

	return S_OK;
}

//****************************************************************
// 破棄
//****************************************************************
void CRanking::Uninit(void)
{

}

//****************************************************************
// 更新
//****************************************************************
void CRanking::Update(void)
{

}

//****************************************************************
// 描画
//****************************************************************
void CRanking::Draw(void)
{

}
